{
    "version": "1.0",
    "last_updated": "2025-01-27",
    "topics": {
        "fuel_pricing": {
            "name": "Fuel Pricing",
            "description": "Fuel pricing policies, subsidies, and pump price changes affecting petroleum products in Nigeria. Includes discussions about petrol, diesel, gasoline pricing, fuel subsidy removal or implementation, pump price adjustments, and economic impact of fuel pricing decisions by the government and NNPC. Covers both increases and decreases in fuel prices, subsidy policies, and public reactions to pricing changes.",
            "keywords": [
                "fuel",
                "petrol",
                "diesel",
                "subsidy",
                "pump price",
                "pricing",
                "gasoline",
                "pms",
                "pms price",
                "refinery",
                "petroleum price",
                "fuel cost",
                "petrol price",
                "diesel price",
                "fuel subsidy"
            ],
            "category": "energy"
        },
        "presidential_announcements": {
            "name": "Presidential Announcements",
            "description": "Official statements, declarations, and announcements made by the President of Nigeria. Includes presidential speeches, policy announcements, executive orders, state of the nation addresses, press conferences, and public statements from the presidency. Covers major policy decisions, cabinet appointments, national addresses, and presidential communications to the public.",
            "keywords": [
                "president",
                "announced",
                "declared",
                "stated",
                "executive",
                "presidential",
                "commander in chief",
                "presidency",
                "presidential statement",
                "presidential speech",
                "executive order",
                "state of the nation"
            ],
            "category": "executive"
        },
        "military_operations": {
            "name": "Military Operations",
            "description": "Military activities, operations, and defense matters in Nigeria. Includes army operations, troop deployments, defense strategies, military exercises, armed forces activities, combat operations, and national security operations. Covers both domestic and international military engagements, defense policy, and security operations.",
            "keywords": [
                "military",
                "army",
                "operation",
                "troops",
                "defense",
                "armed forces",
                "soldiers",
                "combat",
                "deployment",
                "nigerian army",
                "military operation",
                "defence",
                "national security"
            ],
            "category": "security"
        },
        "education_funding": {
            "name": "Education Funding",
            "description": "Education budget, funding, and financial allocations for educational institutions in Nigeria. Includes school funding, university budgets, educational grants, scholarship programs, tuition fees, and government allocations to education sector. Covers primary, secondary, and tertiary education funding, educational infrastructure investments, and financial support for students.",
            "keywords": [
                "education",
                "funding",
                "budget",
                "school",
                "university",
                "educational",
                "academic",
                "scholarship",
                "tuition",
                "education budget",
                "school funding",
                "university funding",
                "educational grant"
            ],
            "category": "education"
        },
        "asuu_strikes": {
            "name": "ASUU Strikes",
            "description": "Academic Staff Union of Universities strikes and negotiations in Nigeria. Includes ASUU industrial actions, lecturer strikes, university staff disputes, academic union negotiations, and university closure due to strikes. Covers strike negotiations, demands, resolutions, and impact on higher education in Nigeria.",
            "keywords": [
                "asuu",
                "strike",
                "lecturers",
                "academic staff",
                "university strike",
                "asuu strike",
                "lecturer strike",
                "academic union",
                "university lecturers",
                "asuu industrial action",
                "academic staff union"
            ],
            "category": "education"
        },
        "healthcare_crisis": {
            "name": "Healthcare Crisis",
            "description": "Healthcare system problems, hospital failures, medical shortages, and health crises in Nigeria. Includes hospital infrastructure issues, medical equipment shortages, healthcare funding problems, and public health emergencies. Covers healthcare service delivery challenges, medical personnel shortages, and health system failures.",
            "keywords": [
                "healthcare",
                "hospital",
                "medical",
                "crisis",
                "health",
                "healthcare system",
                "medical shortage",
                "hospital failure",
                "health crisis",
                "public health",
                "medical emergency",
                "healthcare funding"
            ],
            "category": "health"
        },
        "security_threats": {
            "name": "Security Threats",
            "description": "Security breaches, terrorist attacks, crime waves, and insecurity issues in Nigeria. Includes banditry, kidnapping, terrorism, insurgency, crime, security challenges, and law enforcement responses. Covers security incidents, threat assessments, security operations, and public safety concerns.",
            "keywords": [
                "security",
                "terrorism",
                "banditry",
                "kidnapping",
                "crime",
                "insecurity",
                "terrorist attack",
                "security threat",
                "law enforcement",
                "police",
                "terrorist",
                "insurgency",
                "security challenge"
            ],
            "category": "security"
        },
        "budget_allocation": {
            "name": "Budget Allocation",
            "description": "National budget allocation, distribution, and fiscal planning in Nigeria. Includes budget announcements, budget breakdown, sectoral allocations, budget implementation, and government spending. Covers annual budget presentations, budget debates, fiscal policy, and allocation of resources across ministries and sectors.",
            "keywords": [
                "budget",
                "allocation",
                "fiscal",
                "government spending",
                "budget announcement",
                "budget breakdown",
                "sectoral allocation",
                "budget implementation",
                "national budget",
                "fiscal planning",
                "budget allocation"
            ],
            "category": "economy"
        },
        "infrastructure_projects": {
            "name": "Infrastructure Projects",
            "description": "Infrastructure development projects, construction, and public works in Nigeria. Includes road construction, bridge building, railway projects, airport development, and public infrastructure initiatives. Covers infrastructure planning, construction progress, project completion, and infrastructure investments.",
            "keywords": [
                "infrastructure",
                "construction",
                "project",
                "road",
                "bridge",
                "railway",
                "airport",
                "public works",
                "development",
                "infrastructure development",
                "construction project",
                "public infrastructure"
            ],
            "category": "infrastructure"
        },
        "corruption_cases": {
            "name": "Corruption Cases",
            "description": "Corruption scandals, fraud cases, and anti-corruption efforts in Nigeria. Includes embezzlement, bribery, financial fraud, corruption investigations, EFCC cases, and accountability measures. Covers corruption allegations, investigations, prosecutions, and anti-corruption initiatives.",
            "keywords": [
                "corruption",
                "fraud",
                "scandal",
                "embezzlement",
                "bribery",
                "efcc",
                "anti-corruption",
                "corruption case",
                "financial fraud",
                "accountability",
                "corruption investigation",
                "economic and financial crimes"
            ],
            "category": "governance"
        },
        "power_outages": {
            "name": "Power Outages",
            "description": "Electricity supply problems, power outages, and energy shortages in Nigeria. Includes blackouts, load shedding, electricity generation issues, transmission problems, and power sector challenges. Covers power supply disruptions, energy crises, and electricity infrastructure failures.",
            "keywords": [
                "power",
                "electricity",
                "outage",
                "blackout",
                "load shedding",
                "power cut",
                "electricity shortage",
                "power supply",
                "energy crisis",
                "power failure",
                "electricity problem",
                "power outage"
            ],
            "category": "energy"
        },
        "unemployment": {
            "name": "Unemployment",
            "description": "Unemployment issues, job creation, and employment challenges in Nigeria. Includes youth unemployment, job market conditions, employment statistics, job creation initiatives, and labor market problems. Covers unemployment rates, job opportunities, and employment policy.",
            "keywords": [
                "unemployment",
                "job",
                "employment",
                "jobless",
                "unemployed",
                "job creation",
                "employment rate",
                "job market",
                "youth unemployment",
                "employment opportunity",
                "labor market"
            ],
            "category": "economy"
        },
        "inflation": {
            "name": "Inflation",
            "description": "Inflation rates, price increases, and economic inflation concerns in Nigeria. Includes consumer price index, inflation statistics, cost of living increases, price hikes, and economic inflation impacts. Covers inflation trends, monetary policy responses, and inflation effects on citizens.",
            "keywords": [
                "inflation",
                "price increase",
                "cost of living",
                "inflation rate",
                "price hike",
                "economic inflation",
                "consumer price",
                "inflation statistics",
                "rising prices",
                "price rise"
            ],
            "category": "economy"
        },
        "foreign_affairs": {
            "name": "Foreign Affairs",
            "description": "Diplomatic relations, international cooperation, and foreign policy matters involving Nigeria. Includes diplomatic visits, international agreements, foreign relations, consular services, and Nigeria's role in international organizations. Covers bilateral and multilateral relations, diplomatic engagements, and foreign policy decisions.",
            "keywords": [
                "foreign",
                "diplomacy",
                "diplomatic",
                "international",
                "foreign affairs",
                "diplomatic relations",
                "foreign policy",
                "international relations",
                "diplomatic visit",
                "consular",
                "bilateral",
                "multilateral"
            ],
            "category": "diplomacy"
        },
        "agriculture_food_security": {
            "name": "Agriculture & Food Security",
            "description": "Agricultural policies, food security, farming, and agricultural development in Nigeria. Includes crop production, livestock management, food supply, agricultural funding, farming initiatives, and food security programs. Covers agricultural productivity, food availability, and agricultural sector challenges.",
            "keywords": [
                "agriculture",
                "agricultural",
                "food security",
                "farming",
                "crop",
                "livestock",
                "food supply",
                "agricultural policy",
                "farming",
                "agricultural development",
                "food production",
                "agricultural sector"
            ],
            "category": "agriculture"
        }
    }
}
















